//১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো। 
// var name='ASaduz Zaman';//types of string
// let isSheblu=true;//types of bollean
// const num=12;//types of Number
//২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে। 
// let num1=12//changeable let
// num1=10;

// console.log(num1);
// const nums=11;//not changeable
// nums=12

/* ৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, %এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একইভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো।  */
/* 
let num1=12;
let num2=11;
let sum=num1+num2;
console.log(sum);
let substract=num1-num2;
console.log(substract);
let multliplication=num1*num2;
console.log(multliplication);
const division=num1/num2;
console.log(division);
const modulas=num1%num2;
console.log(modulas);

 */
/* ৪. তুমি কি দুইটা ভেরিয়েবল এরমধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথমটা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো।  */
// let num1=10;
// let num2=12;
// //প্রথমটা সেকেন্ডটা এর চাইতে ছোট
// if (num1<num2) {
//     console.log(true);
// }
// //প্রথমটা সেকেন্ডটা এর চাইতে বড়
// if(num1>num2){
//     console.log(false)
// }
// //প্রথমটা সেকেন্ডটা এর অসমান
//  if(num1!=num2){
//     console.log(true);
// }

// //প্রথমটা সেকেন্ডটা এর সমান
// if(num1==num2){
//     console.log(false);
// }
// //প্রথমটা সেকেন্ডটা এর  ছোট বা সমান
// if(num1<=num2){
//     console.log(true);
// }
// //প্রথমটা সেকেন্ডটা এর বড় বা সমান
// if(num1>=num2){
//     console.log(false );
// }

/* ৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একইভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো।  */

/* var num1=10;
var num2=20;
//দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে
if(num1<num2 && num1==num2){
    console.log("duita soman");
}
//দুইটা শর্তের যেকোন একটা পূরণ কর
else if(num1<num2 || num1==num2){
    console.log("duitar moddhe 1 ta soman");
}

 */

/* ৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো  */
/* var name1='asad'
var name2='zaman'

if(name1== name2){
    console.log(FontFaceSetLoadEvent);
}
else if(name1!=name2){
    console.log(true);
} */
/* ৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো।  */

/* let i=5;
while(i<=19){
    i=i+2
    console.log(i);
} */
/* ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে।  */

/* let arr=['sheblu','fancy','peplu','nipu','jannat','toyasin']
//কয়টা উপাদান আছে সেটা বের কর
console.log(arr.length);
//array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ কর
arr[3]='jannatul'
console.log(arr);
//array এর মধ্যে দুইটা/3 ta উপাদান যোগ করতে হবে
arr.push('fahim','fariha','faiza')
console.log(arr);
//একটা উপাদান কে বের করে দিতে হবে
arr.pop()
console.log(arr); */

/* ৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো।  */

/* var arr=[
    'sheblu', 'fancy',
    'peplu',  'jannatul',
    'jannat', 'toyasin',
    'fahim',  'fariha',
    'faiza'
  ]
//regular for loop
for(let i=0;i<arr.length;i++){
    const element=arr[i]
    console.log(element);
}
//of system for loop
for(const element of arr){
    console.log(element);
} */

/* ১০. তোমাকে যদি বলা হয়। একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো  */
/* var arr=[12,34,67,89,80,123,1,223,4,5,6]
 for(let i=0;i<arr.length;i++){
     const element=arr[i]
     if(element>80){
         console.log(element)
     }
 } */
 /* ১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউটপুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো।  */

 /* function threeNumber(num1,num2,num3){
     let multliplication=num1*num2*num3
     return multliplication
 }
  let output=threeNumber(10,12,14);
  console.log(output); */
/* 
  ১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা।  */
/* 
  var mySelf={
      name:"Asaduz zaman",
      age:22,
      aim:'Web developer'
      
  }
  mySelf.age=23;
  console.log(mySelf); */
